1password-cli
alfred
android-platform-tools
android-sdk
android-studio
android-studio-preview
bitbar
ccmenu
discord
disk-inventory-x
docker
electron
firefox
gimp
google-cloud-sdk
insomnia
intel-haxm
iterm2
java8
licecap
logitech-g-hub
powershell
sensiblesidebuttons
spectacle
spotify
the-unarchiver
ultimaker-cura
visual-studio-code
vlc
vnc-viewer
yt-music
