tap "ankitpokhrel/jira-cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "python@3.9"
brew "autossh"
brew "coreutils"
brew "git"
brew "gnupg"
brew "jq"
brew "node"
brew "nvm"
brew "pinentry-mac"
brew "terminator"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "ykman"
brew "ankitpokhrel/jira-cli/jira-cli"
cask "1password"
cask "alfred3"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "league-of-legends"
cask "openscad"
cask "slack"
cask "spectacle"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "zoom"
