tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae", "https://github.com/jorpilo/homebrew-formulae.git"
tap "mongodb/brew"
tap "nikitabobko/tap"
# Run your GitHub Actions locally
brew "act"
# Record and share terminal sessions
brew "asciinema"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# New way of working with Protocol Buffers
brew "buf"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Run arbitrary commands when files change
brew "entr"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Convert the output from many profilers into a Graphviz dot graph
brew "gprof2dot"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# CLI for managing resources in InfluxDB v2
brew "influxdb-cli"
# Dead simple terminal plots from JSON data
brew "jp"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line, double-entry accounting tool
brew "ledger"
# Platform built on V8 to build network applications
brew "node"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Java-based project management
brew "maven"
# Command-line interface (CLI) for mermaid
brew "mermaid-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Small collection of programs that operate on patch files
brew "patchutils"
# General-purpose scripting language
brew "php"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Pluggable linter and fixer to enforce Protocol Buffer style and conventions
brew "protolint"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Sophisticated calendar and alarm
brew "remind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Command-line utility for Structurizr
brew "structurizr-cli"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Multiple GNOME terminals in one window
brew "terminator"
# Tool to build, change, and version infrastructure
brew "terraform"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich interactive Jira command-line
brew "ankitpokhrel/jira-cli/jira-cli"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# GPU-accelerated terminal emulator
cask "alacritty"
# Android SDK component
cask "android-platform-tools"
# Tools for the Android SDK
cask "android-sdk"
# Tools for building Android applications
cask "android-studio"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Disk usage utility
cask "disk-inventory-x"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Grammarly for desktop
cask "grammarly-desktop"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Animated screen capture application
cask "licecap"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# Network monitoring tool
cask "pingplotter"
# Collaboration platform for API development
cask "postman"
# Utility to automate tasks and improve power management
cask "power-manager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Web browser
cask "sigmaos"
# Team communication and collaboration software
cask "slack"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# USB serial driver
cask "wch-ch34x-usb-serial-driver"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Flash tool for ZSA keyboards
cask "zsa-wally"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "jasonwthompson.7-billion-humans-language-support"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "vespa-dev-works.jestrunit"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"
